// pages/asks/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataList: [
      {
        title: '[发奖]如何修改/取消抽奖',
        content: '已有参与者的活动，不可修改或取消。未有参与者的情况下可删除抽奖，已有参与者的情况，请与参与者沟通。'
      },
      {
        title: '[发奖]如何设置封面图片',
        content: '封面图片尺寸为900*450像素。如果您的图片尺寸不是这个比例也没关系，我们会将图片居中显示，详情页面支持查看大图。建议选择比较美观的图片，可以提高活动效果。'
      },
      {
        title: '[发奖]如何选择奖品类型',
        content: '需要邮寄的奖品，请选择“实物”类型，其他的选择“其他”类型，必要时可在“抽奖说明”里说明清楚。'
      },
      {
        title: '如何设置一-二 三等奖',
        content: '默认的奖品设置只有一个，即一等奖;如需添加多个奖品类型，请点击“添加奖项”，最多可以6个奖项,对应几等奖。'
      },
      {
        title: '[抽奖]为什么没有收到奖品',
        content: '目前“校园抽奖小助手”小程序不参与发货相关流程，整个发货流程由发奖人提供，实物奖品由发奖人直接寄到您提供的地址，虚拟奖品请看活动说明，建议中奖后主动联系发奖人，如遇虚假抽奖，可向我们反馈投诉:个人中心下面的“免责说明与投诉”，描述好问题和提供相关截图后提交，我们核实后会酌情对发奖者处罚。'
      },
      {
        title: '[抽奖]怎么兑换奖品',
        content: '实物奖品需要发货的，请在开奖后3天内填好收货地址等待发奖人发奖，- 般1- -2周的时间可以收到奖品，由于“校园抽奖小助手”不参与发货流程，建议您主动联系发奖人;实物奖品需要自提的，根据抽奖说明按照流程操作;虚拟奖品的根据抽奖说明兑奖，不懂使用的话请主动联系发奖人。'
      },
      {
        title: '[其他]为何经常参与抽奖却从未曾中过',
        content: '“校园抽奖小助手”作为第三方抽奖平台，所有抽奖均由程序随机抽取，我们不会指定中奖、黑箱操作。如果您经常参与抽奖但没有中奖，不如试试自己发起一个抽奖，邀请好友参与，也很有乐趣。'
      },
      {
        title: '[其他]如何上首页',
        content: '上首页是针对发奖者希望获得更多曝光和展示或需要进行品牌宣传与产品推荐的服务，分为今日福利和自助福利两个栏目。自助福利，企业和个人均可以自助加入，通过首页或发奖页入口自助提交即可;今日福利，只支持企业用户，如有需要请联系客服。'
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})